package kumagai.Fukkatsu.logic;

/**
 * 王様のせりふデータ。
 */
public class JumonSerifu
{
	static public String serifu1 =
		"＊「おお　%s！\r\n" +
		"　　よくぞ　ぶじで　もどってきた。\r\n" +
		"　　わしは　とても　うれしいぞ。\r\n" +
		"\r\n" +

		"＊「そなたが　つぎのレベルになるには\r\n" +
		"　　あと　%sポイントの\r\n" +
		"　　けいけんが　ひつようじゃ。\r\n" +
		"\r\n" +

		"＊「そなたに　ふっかつの　じゅもんを\r\n" +
		"　　おしえよう！\r\n" +
		"\r\n" +

		"　　%s\r\n" +
		"　　%s\r\n" +
		"\r\n" +

		"＊「これを　かきとめておくのだぞ。\r\n" +
		"\r\n" +

		"＊「では　また　あおう！\r\n" +
		"　　ゆうしゃ　%sよ！";

	static public String serifuKing =
		"＊「おお　%s！\r\n" +
		"　　よくぞ　ぶじで　もどってきた。\r\n" +
		"　　わしは　とても　うれしいぞ。\r\n" +
		"\r\n" +

		"＊「そなたは　もう　じゅうぶんに\r\n" +
		"　　つよい！　なぜに　まだ\r\n" +
		"　　りゅうおうを　たおせぬのか？\r\n" +
		"\r\n" +

		"＊「そなたに　ふっかつの　じゅもんを\r\n" +
		"　　おしえよう！\r\n" +
		"\r\n" +

		"　　%s\r\n" +
		"　　%s\r\n" +
		"\r\n" +

		"＊「これを　かきとめておくのだぞ。\r\n" +
		"\r\n" +

		"＊「では　また　あおう！\r\n" +
		"　　ゆうしゃ　%sよ！\r\n";

	static public String serifuRyuuou =
		"＊「よくきた　%sよ。\r\n" +
		"　　わしが　おうのなかの　おう\r\n" +
		"　　りゅうおうだ。\r\n" +
		"＊「わしは　まっておった。\r\n" +
		"　　そなたのような　わかものが\r\n" +
		"　　あらわれることを…\r\n" +
		"＊「もし　わしの　みかたになれば\r\n" +
		"　　せかいの　はんぶんを\r\n" +
		"　　%sに　やろう。\r\n" +
		"＊「どうじゃ？\r\n" +
		"　　わしの　みかたに　なるか？\r\n" +

		"＊「ほんとうだな？\r\n" +

		"＊「では　せかいの　はんぶん\r\n" +
		"　　やみのせかいを　あたえよう！\r\n" +
		"　　そして…\r\n" +
		"＊「そなたに　ふっかつの　じゅもんを\r\n" +
		"　　あたえよう！\r\n" +
		"\r\n" +

		"　　%s\r\n" +
		"　　%s\r\n" +
		"\r\n" +

		"＊「これを　かきとめておくのだぞ。\r\n" +
		"＊「おまえの　たびは　おわった。\r\n" +
		"　　さあ　ゆっくり　やすむがよい！\r\n" +
		"　　わあっはっはっはっ\r\n";
}
